import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:gromada/Pages/services/ApiProviderStatHash.dart';
import 'package:gromada/Pages/services/ChartsDepository.dart';
import 'package:gromada/local_datastore/hive_service.dart';
import 'package:hexcolor/hexcolor.dart';
import 'package:hive_flutter/hive_flutter.dart';

List grom55900 = [
  '55900',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];

List grom55901 = [
  '55901',
  '5',
  "343.9 км 2 ",
  "19495",
  "17305",
  "2190",
  "Ольгинка",
  "сільське господарство, добувна промисловість"
];
List grom55902 = [
  '55902',
  '13',
  "663.0 км 2 ",
  "12382",
  "0",
  "012382",
  "Хлібодарівка",
  "сільське господарство, добувна промисловість "
];
List grom55903 = [
  '55903',
  '5',
  "415.4 км 2 ",
  "12004",
  "4261",
  "7743",
  "Мирне",
  "сільське господарство"
];

List grom54300 = [
  '54300',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom55700 = [
  '55700',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom55701 = [
  '55701',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom55702 = [
  '55702',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom50300 = [
  '50300',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom50301 = [
  '50301',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];

List grom50500 = [
  '50500',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom50501 = [
  '50501',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom50502 = [
  '50502',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom50503 = [
  '50503',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom50504 = [
  '50504',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom50505 = [
  '50505',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom51100 = [
  '51100',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom51300 = [
  '51300',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom51500 = [
  '51500',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom51501 = [
  '51501',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom51502 = [
  '51502',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom51503 = [
  '51503',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom51700 = [
  '51700',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom52300 = [
  '52300',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom52301 = [
  '52301',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom52500 = [
  '52500',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom52700 = [
  '52700',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom52701 = [
  '52701',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom52702 = [
  '52702',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom52900 = [
  '52900',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom53300 = [
  '53300',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom53301 = [
  '53301',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom53500 = [
  '53500',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom53700 = [
  '53700 ',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom53701 = [
  '55900',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom53702 = [
  '53702',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom53703 = [
  '53703',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom53704 = [
  '53704',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom55100 = [
  '55100',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom55101 = [
  '55101',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom56100 = [
  '56100',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom56101 = [
  '56101',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom56900 = [
  '56900',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom56901 = [
  '56901',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom57300 = [
  '57300',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];
List grom58500 = [
  '58500',
  '10',
  " 539.5 км 2 ",
  "36588",
  "26391",
  "10197",
  " Волноваха",
  "сільське господарство, тогівля та сфера послуг, залізничний транспорт"
];

class ChartController extends GetxController {
  late dynamic value;
  List stat = [];
  RxBool isLoading = true.obs;
  late List gromada = [].obs;
  List bezrab = [].obs;
  List bezrab0 = [];
  final HiveService hiveService = HiveService();

  @override
  Future<void> onInit() async {
    await Hive.initFlutter();
    await Hive.openBox("stat");
    value = Get.arguments;
    fetchVac();
    //print(gromada.length);
    print(value);
    //print(gromada);
    super.onInit();
  }

  void savehash() async {
    await Hive.initFlutter();
    var box = await Hive.openBox("stathash");
    String? stathash = box.get('hash').toString();
    print('Getting main ${stathash}');
    if (stathash != await ApiProviderStatHash.fetchHash()) {
      String? vachash = (await ApiProviderStatHash.fetchHash());
      box.put('hash', vachash);
      saveLocal();
      print('Getting stathashmain ${box.get('hash').toString()}');
    } else {
      print('No update!');
    }
  }

  void saveLocal() async {
    await Hive.initFlutter();
    var box = await Hive.openBox("stathash");
    String stathash = (await ApiProviderStatHash.fetchHash());
    box.put('hash', stathash);
    print('Getting hashsave ${box.get('hash').toString()}');
    await Hive.openBox("stat");
    final HiveService hiveService = HiveService();
    Hive.box('stat').clear();
    stat = await ChartsRepository.getAllCharts();
    hiveService.addBoxes(stat, "stat");
    Get.snackbar(
      "Онлайн помічник", // title
      "Інформація щодо громади оновлено!", // message
      icon: Icon(Icons.alarm),
      shouldIconPulse: true,
      colorText: HexColor('#005BAA'),
      backgroundColor: Colors.amber,
      barBlur: 20,
      isDismissible: true,
      duration: Duration(seconds: 3),
    );
    print("Getting vac ${stat.length}");
  }

  void fetchVac() async {
    stat = await hiveService.getBoxes("stat");
    // print("Getting loaclstoreIncharts ${stat.length}");
    if (stat.length != 0) {
      // print("Getting  ${await hiveService.getBoxes("stat")}");
      // print("Getting2  ${(await ChartsRepository.getAllCharts()).toList()}");
      bezrab0 = await hiveService.getBoxes("stat");
      print(bezrab0.map((item) => [
            item.gromada,
            item.maintown,
            item.counttown,
            item.sgromada,
            item.people,
            item.economic,
            item.period
          ]));
      print(
        bezrab0[0],
      );
      print("Getting data from HiveCharts");
    } else {
      bezrab0 = await ChartsRepository.getAllCharts();
      //saveLocal();
      print("Getting data from API");
    }
    //bezrab = bezrab0.where((item) =>(int.tryParse(item.gromada)==int.tryParse(value)) as List<Charts>);
    bezrab = bezrab0
        .where((item) =>
            (item.gromada.toLowerCase().contains(value.toLowerCase())))
        .toList();
    print("filter:${bezrab}");
    print("filter:${bezrab.map((item) => [item.gromada, item.maintown])}");
    isLoading.value = false;
  }

  allgromad() {
    int? a = int.tryParse(bezrab[0].temporarywork);
    int? b = int.tryParse(bezrab[0].gromadwork);
    // int? a = int.tryParse("3");
    // int? b = int.tryParse("5");
    int? d;
    d = (a! + b!);
    return d.toStringAsFixed(0);
  }

  Map<String, double> data = new Map();

  Map<String, double> data1 = new Map();
}
