import 'package:get/get.dart';

List<Map<String, String>> rayon01 = [
  {'name': "Оберіть відповідну громаду", 'value': '0'},
  {'name': 'Сіверська територіальна громада', 'value': '55900'},
  {'name': 'Званівська територіальна громада', 'value': '55901'},
  {'name': 'Бахмутська територіальна громада', 'value': '55902'},
  {'name': 'Часовоярська територіальна громада', 'value': '55903'},
  {'name': 'Світлодарська територіальна громада', 'value': '54300'},
  {'name': 'Соледарська територіальна громада', 'value': '55700'},
  {'name': 'Торецька територіальна громада', 'value': '55701'},
];
List<Map<String, String>> rayon02 = [
  {'name': "Оберіть відповідну громаду", 'value': '0'},
  {'name': 'Волноваська територіальна громада', 'value': '55900'},
  {'name': 'Ольгинська територіальна громада', 'value': '55901'},
  {'name': 'Хлібодарівська територіальна громада', 'value': '55902'},
  {'name': 'Мирненська територіальна громада', 'value': '55903'},
  {'name': 'Вугледарська територіальна громада', 'value': '54300'},
  {'name': 'Старомлинівська територіальна громада', 'value': '55700'},
  {'name': 'Комарська територіальна громада', 'value': '55701'},
  {'name': 'Великоновосілківська територіальна громада', 'value': '55702'}
];
List<Map<String, String>> rayon03 = [
  {'name': "Оберіть відповідну громаду", 'value': '0'},
  {'name': 'Олександрівська територіальна громада', 'value': '55900'},
  {'name': 'Святогірська територіальна громада', 'value': '55901'},
  {'name': 'Новодонецька територіальна громада', 'value': '55902'},
  {'name': 'Краматорська територіальна громада', 'value': '55903'},
  {'name': 'Дружківська територіальна громада', 'value': '54300'},
  {'name': 'Лиманська територіальна громада', 'value': '55700'},
  {'name': 'Черкаська територіальна громада', 'value': '55701'},
  {'name': 'Миколаївська територіальна громада', 'value': '55702'},
  {'name': 'Андріївська територіальна громада', 'value': '55702'},
  {'name': 'Слов\'янська територіальна громада', 'value': '55702'},
  {'name': 'Костянтинівська територіальна громада', 'value': '55702'},
  {'name': 'Іллінівська територіальна громада', 'value': '55702'}
];
List<Map<String, String>> rayon04 = [
  {'name': "Оберіть відповідну громаду", 'value': '0'},
  {'name': 'Мангушська територіальна громада', 'value': '55900'},
  {'name': 'Маріупольська територіальна громада', 'value': '55901'},
  {'name': 'Сартанська територіальна громада', 'value': '55902'},
  {'name': 'Кальчицька територіальна громада', 'value': '55903'},
  {'name': 'Нікольська територіальна громада', 'value': '54300'},
];
List<Map<String, String>> rayon05 = [
  {'name': "Оберіть відповідну громаду", 'value': '0'},
  {'name': 'Очеретинська територіальна громада', 'value': '55900'},
  {'name': 'Криворізька територіальна громада', 'value': '55901'},
  {'name': 'Гродівська територіальна громада', 'value': '55902'},
  {'name': 'Селидівська територіальна громада', 'value': '55903'},
  {'name': 'Удачненська територіальна громада', 'value': '54300'},
  {'name': 'Покровська територіальна громада', 'value': '55700'},
  {'name': 'Авдіївська територіальна громада', 'value': '55701'},
  {'name': 'Курахівська територіальна громада', 'value': '54300'},
  {'name': 'Новогродівська територіальна громада', 'value': '55700'},
  {'name': 'Шахівська територіальна громада', 'value': '55701'},
  {'name': 'Мирноградська територіальна громада', 'value': '55702'},
  {'name': 'Мар\'їнська територіальна громада', 'value': '55702'},
  {'name': 'Білозерська територіальна громада', 'value': '54300'},
];

class ChoiceController extends GetxController {
  dynamic value = Get.arguments;

  final selected = "0".obs;

  List<Map<String, String>> listType = int.parse(Get.arguments) == 1
      ? rayon01
      : int.parse(Get.arguments) == 2
          ? rayon02
          : int.parse(Get.arguments) == 3
              ? rayon03
              : int.parse(Get.arguments) == 4
                  ? rayon04
                  : int.parse(Get.arguments) == 5
                      ? rayon05
                      : [];

  void setSelected(value) {
    selected.value = value;
    value == "0"
        ? Get.toNamed('/Home/choice', arguments: value)
        : Get.toNamed('/choicegromad', arguments: value);
  }
}
