import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:get/get.dart';
import 'package:gromada/Pages/Search/models/vac.dart';
import 'package:gromada/Pages/services/VacDepository.dart';
import 'package:gromada/local_datastore/hive_service.dart';
import 'package:hexcolor/hexcolor.dart';
import 'package:hive/hive.dart';
import 'package:hive_flutter/hive_flutter.dart';

const grom55900 = [
  "1421586403",
  "1421510100",
  "1421587201",
  "1421582802",
  "1421587203",
  "1421586404",
  "1421581203",
  "1421587204",
  "1421584801",
  "1421586401",
  "1421586402",
  "1421583601",
  "1421582801",
  "1421510102",
  "1421581401",
  "1421510103",
  "1421584802",
  "1421587601",
  "1421510101",
  "1421581201",
  "1421555900",
  "1421587202",
  "1421581202"
];
const grom55901 = [
  "1421557202",
  "1421555600",
  "1421584001",
  "1421557200",
  "1421584003",
  "1421556500",
  "1421556800",
  "1421584002",
  "1421555300",
  "1421557201",
  "1421584004"
];
const grom55902 = [
  "1421580401",
  "1421583101",
  "1421582001",
  "1421586801",
  "1421583001",
  "1421582406",
  "1421588001",
  "1421584701",
  "1421582403",
  "1421582003",
  "1421586802",
  "1421585601",
  "1421583202",
  "1421584703",
  "1421583201",
  "1421585604",
  "1421582401",
  "1421582402",
  "1421586301",
  "1421585603",
  "1421582405",
  "1421587901",
  "1421581301",
  "1421582404",
  "1421580404",
  "1421587903"
];
const grom55903 = [
  "1421589205",
  "1421589202",
  "1421588801",
  "1421588802",
  "1421555101",
  "1421555100",
  "1421510101",
  "1421589206",
  "1421589204",
  "1421589203",
  "1421555102",
  "1421587701",
  "1421556600",
  "1421555103",
  "1421589201"
];
const grom54300 = [
  "1423382001",
  "1421584401",
  "1414890004",
  "1423385802",
  "1414800000",
  "1423385803",
  "1414890001",
  "1421581601",
  "1421280803",
  '1414890006',
  "1414890003",
  "1414890002",
  "1414890005",
  "1421586001",
  "1421280204"
];
const grom55701 = [
  "1421283601",
  "1421284003",
  "1421283603",
  "1421285202",
  "1421281201",
  "1421284002",
  "1421284001",
  "1421285205",
  "1421285204",
  "1421285201",
  "1423385002",
  "1421285203",
  "1421283604",
  "1421283001"
];
const grom55702 = [
  "1421286602",
  "1421282405",
  "1421284402",
  "1421282407",
  "1421282401",
  "1421284403",
  "1421280204",
  "1421282403",
  "1421286605",
  "1421284406",
  "1421282404",
  "1421281802",
  "1421286607",
  "1421282406",
  "1421284405",
  "1421281801",
  "1421286604",
  "1421284404",
  "1421286606",
  "1421284401",
  "1421286603",
  "1421282409",
  "1421282408",
  "1421282402"
];
const grom55700 = [
  "1421286401",
  "1421286403",
  "1421255104",
  "1421280802",
  "1421255103",
  "1421281402",
  "1421282702",
  "1421282701",
  "1421280203",
  "1421282703",
  "1421255100",
  "1421580801",
  "1421255101",
  "1421286402",
  "1421284802",
  "1421280805",
  "1421280803",
  "1421284601",
  "1421284805",
  "1421281401",
  "1421255102",
  "1421281403",
  "1421284803",
  "1421280202",
  "1421280204",
  "1421284801",
  "1421280801",
  "1421284804"
];
const grom50300 = ["1425587606", "1410200000"];
const grom50301 = [
  "1425584305",
  "1425584306",
  "1425586504",
  "1425587305",
  "1425582104",
  "1425583201",
  "1425583205",
  "1425587303",
  "1425584301",
  "1425585601",
  "1425584304",
  "1425586503",
  "1425585604",
  "1425587309",
  "1425583203",
  "1425585401",
  "1425584307",
  "1425584303",
  "1425584308",
  "1425555201",
  "1425585603",
  "1425555202",
  "1425582102",
  "1425555301",
  "1425555900",
  "1425587301",
  "1425585602",
  "1425555600",
  "1425555200",
  "1425586501",
  "1425582101",
  "1425555203",
  "1425585402",
  "1425585403",
  "1425587307",
  "1425583101",
  "1425584302",
  "1425555300",
  "1425582103",
  "1425583204"
];

const grom50500 = [
  "1410390014",
  "1410390009",
  "1410390006",
  "1410390008",
  "1410390015",
  "1410300000",
  "1410345600",
  "1410390003",
  "1410390011",
  "1410390010",
  "1410390004",
  "1410390012",
  "1410390016",
  "1410390005",
  "1410390017",
  "1410390001",
  "1410390007",
  "1410390013",
  "1410390002"
];
const grom50501 = [
  "1420983501",
  "1420983504",
  "1420983505",
  '1420983502',
  "1420983506",
  "1420983503"
];
const grom50502 = [
  "1420985004",
  "1420955401",
  "1420955400",
  "1420985005",
  "1420955404",
  "1420986201",
  "1420985002",
  "1420955500",
  "1420986205",
  "1420955405",
  "1420955402",
  "1420985001",
  "1420910818",
  "1420955403",
  "1420986202",
  "1420986203",
  "1420986204",
  "1420910600",
  "1420955406"
];
const grom50503 = [
  "1420910400",
  "1420983903",
  "1420910402",
  "1420910403",
  "1420910405",
  "1420910404",
  "1420910406"
];
const grom50504 = [
  "1420910803",
  "1420910814",
  "1420985003",
  "1420910800",
  "1420910801",
  '1420910815',
  "1420910819",
  "1420910823",
  "1420910824",
  "1420910826",
  "1420910827",
  "1420910828",
  "1420910830",
  "1420910831",
  "1420910834",
  "1420910836",
  "1420910833",
  "1420910817",
  "1420910810",
  "1420910813",
  "1420910806",
  "1420910807",
  "1420910808",
  "1420910809",
  "1420910820",
  "1420910829",
  "1420910812",
  "1420910835",
  "1420910802",
  "1420910805",
  "1420910811",
  "1420910821",
  "1420910822",
  "1420910825",
  "1420910804",
  "1420910816",
  "1420910832"
];
const grom50505 = ["1420983902", "1420911000", "1420985202", "1420983903"];
const grom51100 = [
  "1411246503",
  "1411247200",
  "1411245307",
  "1411245300",
  "1411290001",
  "1411246507",
  "1411245305",
  "1411270300",
  "1411245309",
  "1411246501",
  "1411245600",
  "1411246505",
  "1411245900",
  "1411246800",
  "1411200000",
  "1411246200",
  "1411245301"
];
const grom51300 = ["1422785705", "1422785701", "1411300000", "1411390001"];
const grom51500 = [
  "1422055501",
  "1422088002",
  "1422088001",
  "1411570300",
  "1422055505",
  "1411500000",
  "1422088003",
  "1422055504",
  "1422055500",
  "1422055502",
  "1422081101",
  "1422088004",
  "1411545300",
  "1422055503",
  "1422081105",
  "1422081103"
];
const grom51501 = [
  "1422084406",
  "1422084407",
  "1422084403",
  "1422084408",
  "1422088805",
  "1422082204",
  "1422088809",
  "1422084404",
  "1422084409",
  "1422088804",
  "1422088803",
  "1422088801",
  "1422084405",
  "1422088807",
  "1422084401",
  "1422088808",
  "1422084402",
  "1422088806",
  "1422082202",
  "1422082201",
  "1422082203",
  "1422088802"
];
const grom51502 = [
  "1422087701",
  "1422087706",
  "1422083305",
  "1422083303",
  "1422083301",
  "1422083306",
  "1422083302",
  "1422083304",
  "1422083311",
  "1422083309",
  "1422087707",
  "1422087704",
  "1422087703",
  "1422087711",
  "1422087714",
  "1422087710",
  "1422087705",
  "1422087712",
  "1422087709",
  "14220877 02",
  "1422087713",
  "1422087708"
];
const grom51503 = [
  "1422085505",
  "1411570500",
  "1422085504",
  "1422085502",
  "1422085503",
  "1411570501",
  "1422085501"
];
const grom51700 = [
  "1422486007, Донецька область, Костянтинівський район, Павлівка",
  "1411745600, Донецька область, Дружківка, Новогригорівка",
  "1411745800, Донецька область, Дружківка, Новомиколаївка",
  "1411746201, Донецька область, Дружківка, Красний Кут",
  "1411746200, Донецька область, Дружківка, Райське",
  "1411700000, Донецька область, Дружківка",
  "1411790003, Донецька область, Дружківка, Дружківське",
  "1422483505, Донецька область, Костянтинівський район, Осикове",
  "1422486013, Донецька область, Костянтинівський район, Райське",
  "1422486001, Донецька область, Костянтинівський район, Торське",
  "1422484401, Донецька область, Костянтинівський район, СОФІЇВКА",
  "1411746203, Донецька область, Дружківка, Старорайське",
  "1422483501, Донецька область, Костянтинівський район, Кіндратівка",
  "1422486011, Донецька область, Костянтинівський район, Приют",
  "1422486015, Донецька область, Костянтинівський район, Торецьке",
  "1422483503, Донецька область, Костянтинівський район, Куртівка",
  "1422486005, Донецька область, Костянтинівський район, Новопавлівка",
  "1422483901, Донецька область, Костянтинівський район, Миколайпілля",
  "1422486009, Донецька область, Костянтинівський район, Петрівка",
];
const grom52300 = [
  "1422484103, Донецька область, Костянтинівський район, Молочарка",
  "1422483705, Донецька область, Костянтинівський район, Новомаркове",
  "1422484102, Донецька область, Костянтинівський район, Іжевка",
  "1422482003, Донецька область, Костянтинівський район, Клинове",
  "1422482002, Донецька область, Костянтинівський район, Безімяне",
  "1422482501, Донецька область, Костянтинівський район, Іванопілля",
  "1412600000, Донецька область, Костянтинівка",
  "1422483701, Донецька область, Костянтинівський район, Маркове",
  "1422482505, Донецька область, Костянтинівський район, Олександро-Шультине",
  "1422481501, Донецька область, Костянтинівський район, Білокузьминівка",
  "1422482001, Донецька область, Костянтинівський район, Віролюбівка",
  "1422485703, Донецька область, Костянтинівський район, Ступочки",
  "1422483707, Донецька область, Костянтинівський район, Федорівка",
  "1422484113, Донецька область, Костянтинівський район, Червоне",
  "1422484001, Донецька область, Костянтинівський район, Миколаївка",
  "1422485701, Донецька область, Костянтинівський район, Предтечине",
  "1422484003, Донецька область, Костянтинівський район, Подільське",
  "1422484111, Донецька область, Костянтинівський район, Стінки",
  "1422483703, Донецька область, Костянтинівський район, Майське",
  "1422482502, Донецька область, Костянтинівський район, Біла Гора",
  "1422482503, Донецька область, Костянтинівський район, Диліївка",
  "1422482504, Донецька область, Костянтинівський район, Неліпівка",
  "1422484101, Донецька область, Костянтинівський район, Новодмитрівка",
  "1422482007, Донецька область, Костянтинівський район, Попасне"
];
const grom52301 = [
  "1422485002, Донецька область, Костянтинівський район, Попів Яр",
  "1422485806, Донецька область, Костянтинівський район, Олександропіль",
  "1422481003, Донецька область, Костянтинівський район, Степанівка",
  "1422485805, Донецька область, Костянтинівський район, Новооленівка",
  "1422481001, Донецька область, Костянтинівський район, Довга Балка",
  "1422485001, Донецька область, Костянтинівський район, Полтавка",
  "1422485004, Донецька область, Костянтинівський район, Русин Яр",
  "1422485802, Донецька область, Костянтинівський район, Березівка",
  "1422483001, Донецька область, Костянтинівський район, Катеринівка",
  "1422484201, Донецька область, Костянтинівський район, Нова Полтавка",
  "1422485803, Донецька область, Костянтинівський район, Водяне Друге",
  "1422480501, Донецька область, Костянтинівський район, Олександро-Калинове",
  "1422481002, Донецька область, Костянтинівський район, Розкішне",
  "1422482301, Донецька область, Костянтинівський район, Зоря",
  "1422483002, Донецька область, Костянтинівський район, Клебан-Бик",
  "1422485501, Донецька область, Костянтинівський район, Стара Миколаївка",
  "1422485504, Донецька область, Костянтинівський район, Калинове",
  "1422485801, Донецька область, Костянтинівський район, Тарасівка",
  "1422482701, Донецька область, Костянтинівський район, ІЛЛІНІВКА",
  "1422480503, Донецька область, Костянтинівський район, Яблунівка"
];
const grom52500 = [
  "1412946201, Донецька область, Краматорськ, Привілля",
  "1412990001, Донецька область, Краматорськ, Ашуркове",
  "1412945601, Донецька область, Краматорськ, Василівська Пустош",
  "1412900000, Донецька область, Краматорськ",
  "1412945900, Донецька область, Краматорськ, Комишуваха",
  "1412945600, Донецька область, Краматорськ, Біленьке",
  "1412947100, Донецька область, Краматорськ, Шабельківка",
  "1412947700, Донецька область, Краматорськ, Ясногірка",
  "1412990003, Донецька область, Краматорськ, Семенівка",
  "1424281001, Донецька область, Слов'янський район, Дмитрівка",
  "1412946200, Донецька область, Краматорськ, Красноторка",
  "1412946500, Донецька область, Краматорськ, Малотаранівка",
  "1412946800, Донецька область, Краматорськ, Софіївка",
  "1412947400, Донецька область, Краматорськ, Ясна Поляна",
  "1412945300, Донецька область, Краматорськ, Олександрівка",
];
const grom52700 = [
  "1413245400, Донецька область, Покровськ, Шевченко",
  "1422784010, Донецька область, Покровський район, Успенівка",
  "1422782805, Донецька область, Покровський район, Новий Труд",
  "1422784007, Донецька область, Покровський район, Новооленівка",
  "1422781101, Донецька область, Покровський район, Гришине",
  "1422782804, Донецька область, Покровський район, Зелене",
  "1422784006, Донецька область, Покровський район, Новоолександрівка",
  "1422782806, Донецька область, Покровський район, Новопавлівка",
  "1422784008, Донецька область, Покровський район, Новопустинка",
  "1422784701, Донецька область, Покровський район, Перше Травня",
  "1422782809, Донецька область, Покровський район, Сухий Яр",
  "1422782803, Донецька область, Покровський район, Даченське",
  "1422784504, Донецька область, Покровський район, Солоне",
  "1422786509, Донецька область, Покровський район, Ясенове",
  "1422786502, Донецька область, Покровський район, Богданівка",
  "1422786501, Донецька область, Покровський район, Срібне",
  "1422786503, Донецька область, Покровський район, Запоріжжя",
  "1422786508, Донецька область, Покровський район, Українка",
  "1422782802, Донецька область, Покровський район, Гнатівка",
  "1422783803, Донецька область, Покровський район, Котлярівка",
  "1422782801, Донецька область, Покровський район, Лисівка",
  "1422784001, Донецька область, Покровський район, Новотроїцьке",
  "1422783807, Донецька область, Покровський район, Пушкіне",
  "1422784502, Донецька область, Покровський район, Вовкове",
  "1422784501, Донецька область, Покровський район, Піщане",
  "1422786506, Донецька область, Покровський район, Преображенка",
  "1422786507, Донецька область, Покровський район, Троїцьке",
  "1422784002, Донецька область, Покровський район, Жовте",
  "1422784503, Донецька область, Покровський район, Звірове",
  "1422786504, Донецька область, Покровський район, Новоандріївка",
  "1422784005, Донецька область, Покровський район, Нововасилівка",
  "1422782807, Донецька область, Покровський район, Новоукраїнка",
  "1413200000, Донецька область, Покровськ",
  "1422782810, Донецька область, Покровський район, Чунишине",
  "1422783801, Донецька область, Покровський район, Новоєлизаветівка",
  "1413270600, Донецька область, Покровськ, Родинське",
  "1422784704, Донецька область, Покровський район, Троянда",
  "1422786505, Донецька область, Покровський район, Горіхове",
  "1422784703, Донецька область, Покровський район, Котлине",
  "1422783805, Донецька область, Покровський район, Надеждинка",
  "1422782808, Донецька область, Покровський район, Ріг"
];
const grom52701 = [
  "1422781602, Донецька область, Покровський район, Веселе",
  "1422755304, Донецька область, Покровський район, Миколаївка",
  "1422755301, Донецька область, Покровський район, Журавка",
  "1422755302, Донецька область, Покровський район, Красний Яр",
  "1422788301, Донецька область, Покровський район, Малинівка",
  "1422755602, Донецька область, Покровський район, ФЕДОРІВКА",
  "1422781610, Донецька область, Покровський район, Сергіївка",
  "1422755601, Донецька область, Покровський район, Балаган",
  "1422783603, Донецька область, Покровський район, Воздвиженка",
  "1422755603, Донецька область, Покровський район, Миколаївка",
  "1422755600, Донецька область, Покровський район, Новоекономічна",
  "1422781603, Донецька область, Покровський район, Вовче",
  "1422755300, Донецька область, Покровський район, Гродівка",
  "1422783001, Донецька область, Покровський район, Миролюбівка",
  "1422755604, Донецька область, Покровський район, Михайлівка",
  "1422781604, Донецька область, Покровський район, Євгенівка",
  "1422755303, Донецька область, Покровський район, Крутий Яр",
  "1422781605, Донецька область, Покровський район, Лисичне",
  "1422781608, Донецька область, Покровський район, Прогрес",
  "1422755306, Донецька область, Покровський район, Промінь",
  "1422783602, Донецька область, Покровський район, Баранівка",
  "1422783003, Донецька область, Покровський район, Єлизаветівка",
  "1422781601, Донецька область, Покровський район, Іванівка",
  "1422781606, Донецька область, Покровський район, Лозуватське",
  "1422788303, Донецька область, Покровський район, Мирне",
  "1422755605, Донецька область, Покровський район, Разіне",
  "1422788305, Донецька область, Покровський район, Шевченко Перше",
  "1422755305, Донецька область, Покровський район, Московське",
  "1422784006, Донецька область, Покровський район, Новоолександрівка",
  "1422781607, Донецька область, Покровський район, Новоторецьке",
  "1422781609, Донецька область, Покровський район, Свиридонівка"
];
const grom52702 = [
  "1422786002, Донецька область, Покровський район, КАЛИНІВКА",
  "1422756303, Донецька область, Покровський район, Новомиколаївка",
  "1422781610, Донецька область, Покровський район, Сергіївка",
  "1422756300, Донецька область, Покровський район, Удачне",
  "1422756304, Донецька область, Покровський район, Новосергіївка",
  "1422756301, Донецька область, Покровський район, МОЛОДЕЦЬКЕ",
  "1422756302, Донецька область, Покровський район, Муравка",
];
const grom52900 = [
  "1423086501, Донецька область, Лиманський район, Шандриголове",
  "1423083205, Донецька область, Лиманський район, Нове",
  "1423081801, Донецька область, Лиманський район, Коровій Яр",
  "1423056401, Донецька область, Лиманський район, Закітне",
  "1423083202, Донецька область, Лиманський район, Карпівка",
  "1423082002, Донецька область, Лиманський район, Діброва",
  "1423085403, Донецька область, Лиманський район, Мирне",
  "1423055700, Донецька область, Лиманський район, Зарічне",
  "1423085407, Донецька область, Лиманський район, Ямполівка",
  "1413300000, Донецька область, ЛИМАН",
  "1423084301, Донецька область, Лиманський район, Рубці",
  "1423084304, Донецька область, Лиманський район, Лозове",
  "1423082001, Донецька область, Лиманський район, Крива Лука",
  "1423083203, Донецька область, Лиманський район, Катеринівка",
  "1423085406, Донецька область, Лиманський район, Новосадове",
  "1423056400, Донецька область, Лиманський район, Ямпіль",
  "1423056000, Донецька область, Лиманський район, Новоселівка",
  "1423056601, Донецька область, Лиманський район, Олександрівка",
  "1423087601, Донецька область, Лиманський район, Яцьківка",
  "1423082003, Донецька область, Лиманський район, ОЗЕРНЕ",
  "1423082004, Донецька область, Лиманський район, Каленики",
  "1423084302, Донецька область, Лиманський район, Вовчий Яр",
  "1423055701, Донецька область, Лиманський район, Торське",
  "1423085401, Донецька область, Лиманський район, Терни",
  "1423056602, Донецька область, Лиманський район, Соснове",
  "1423085404, Донецька область, Лиманський район, Іванівка",
  "1423086502, Донецька область, Лиманський район, Зелена Долина",
  "1423086503, Донецька область, Лиманський район, Середнє",
  "1423087603, Донецька область, Лиманський район, Кримки",
  "1423055400, Донецька область, Лиманський район, Дробишеве",
  "1423083206, Донецька область, Лиманський район, Новомихайлівка",
  "1423083201, Донецька область, Лиманський район, Рідкодуб",
  "1423056600, Донецька область, Лиманський район, Ярова",
  "1423085405, Донецька область, Лиманський район, Колодязі",
  "1423083204, Донецька область, Лиманський район, Липове",
  "1423055401, Донецька область, Лиманський район, Дерилове"
];
const grom53300 = [
  "1423981105, Донецька область, Мангушський район, Шевченко",
  "1412345600, Донецька область, Маріуполь, Старий Крим",
  "1423982201, Донецька область, Мангушський район, Покровське",
  "1423982202, Донецька область, Мангушський район, Рибацьке",
  "1423981102, Донецька область, Мангушський район, Агробаза",
  "1412300000, Донецька область, Маріуполь",
  "1423981104, Донецька область, Мангушський район, Приміське",
  "1423981101, Донецька область, Мангушський район, Бердянське",
  "1423982203, Донецька область, Мангушський район, Червоне",
  "1423982204, Донецька область, Мангушський район, Широка Балка",
  "1423981103, Донецька область, Мангушський район, Приазовське"
];
const grom53301 = [
  "1421585803, Донецька область, Волноваський район, Черненко",
  "1421781602, Донецька область, Нікольський район, Водяне",
  "1412345803, Донецька область, Маріуполь, Ломакине",
  "1421583703, Донецька область, Волноваський район, Сопине",
  "1412345800, Донецька область, Маріуполь, Талаківка",
  "1412345300, Донецька область, Маріуполь, Сартана",
  "1421585802, Донецька область, Волноваський район, Пищевик",
  "1421588401, Донецька область, Волноваський район, Широкине",
  "1421583701, Донецька область, Волноваський район, Лебединське",
  "1421588201, Донецька область, Волноваський район, Чермалик",
  "1421588201, Донецька область, Волноваський район, Чермалик",
  "1421589004, Донецька область, Волноваський район, Заїченко",
  "1421589001, Донецька область, Волноваський район, Пікузи",
  "1421781805, Донецька область, Нікольський район, Федорівка",
  "1421588202, Донецька область, Волноваський район, Орловське",
  "1412345801, Донецька область, Маріуполь, Гнутове",
  "1423981101, Донецька область, Мангушський район, Бердянське",
  "1421585801, Донецька область, Волноваський район, Павлопіль"
];
const grom53500 = [
  "1422785001, Донецька область, Покровський район, Петрівка",
  "1413846500, Донецька область, Селидове, Цукурине",
  "1413870900, Донецька область, Селидове, Українськ",
  "1413845300, Донецька область, Селидове, Вишневе",
  "1422785005, Донецька область, Покровський район, Пустинка",
  "1422785003, Донецька область, Покровський район, ГРИГОРІВКА",
  "1422785004, Донецька область, Покровський район, Новоолексіївка",
  "1413800000, Донецька область, Селидове",
  "1422785002, Донецька область, Покровський район, Юр\'ївка"
];
const grom53700 = [
  "1424255600, Донецька область, Слов\'янський район, Билбасівка",
  "1424284701, Донецька область, Слов\'янський район, Мирне",
  "1424255680, Донецька область, Слов\'янський район, Торець",
  "1424255300, Донецька область, Слов\'янський район, Андріївка",
  "1414100000, Донецька область, Слов\'янськ"
];
const grom53701 = [
  "1424284601, Донецька область, Слов\'янський район, Маяки",
  "1424284602, Донецька область, Слов\'янський район, Пришиб",
  "1424282407, Донецька область, Слов\'янський район, Микільське",
  "1424282401, Донецька область, Слов\'янський район, Хрестище",
  "1424284603, Донецька область, Слов\'янський район, Сидорове",
  "1424281502, Донецька область, Слов\'янський район, Богородичне",
  "1424284604, Донецька область, Слов\'янський район, Тетянівка",
  "1424282403, Донецька область, Слов\'янський район, Адамівка",
  "1424281503, Донецька область, Слов\'янський район, Краснопілля",
  "1424281501, Донецька область, Слов\'янський район, Долина",
  "1424281504, Донецька область, Слов\'янський район, Мазанівка",
  "1414170500, Донецька область, Слов\'янськ, Святогірськ",
  "1424282405, Донецька область, Слов\'янський район, Глибока Макатиха"
];
const grom53702 = [
  "1424256500, Донецька область, Слов\'янський район, Черкаське",
  "1424286801, Донецька область, Слов\'янський район, Привілля",
  "1424256501, Донецька область, Слов\'янський район, Іванівка",
  "1424280303, Донецька область, Слов\'янський район, Маячка",
  "1424256505, Донецька область, Слов\'янський район, Шнурки",
  "1424280307, Донецька область, Слов\'янський район, Новоселівка",
  "1424280301, Донецька область, Слов\'янський район, Олександрівка",
  "1424256502, Донецька область, Слов\'янський район, Новомиколаївка",
  "1424280305, Донецька область, Слов\'янський район, Троїцьке",
  "1424285702, Донецька область, Слов\'янський район, Майдан",
  "1424285701, Донецька область, Слов\'янський район, Прелесне"
];
const grom53703 = [
  "1424288201, Донецька область, Слов\'янський район, Сергіївка",
  "1424280501, Донецька область, Слов\'янський район, Андріївка",
  "1424288202, Донецька область, Слов\'янський район, Роганське",
  "1424280502, Донецька область, Слов\'янський район, Варварівка",
  "1424280503, Донецька область, Слов\'янський район, Новоандріївка"
];
const grom53704 = [
  "1424210800, Донецька область, Слов'янський район, Миколаївка",
  "1424283506, Донецька область, Слов'янський район, Тихонівка",
  "1424287902, Донецька область, Слов'янський район, Пискунівка",
  "1424283501, Донецька область, Слов'янський район, Малинівка",
  "1424287901, Донецька область, Слов'янський район, Рай-Олександрівка",
  "1424283505, Донецька область, Слов'янський район, Першомар\'євка",
  "1424283507, Донецька область, Слов'янський район, Юрківка",
  "1424287903, Донецька область, Слов'янський район, Стародубівка",
  "1424283502, Донецька область, Слов'янський район, Васютинське",
  "1424283503, Донецька область, Слов'янський район, Никонорівка",
  "1424283504, Донецька область, Слов'янський район, Оріхуватка"
];
const grom55100 = [
  "1420355105, Донецька область, Олександрівський район, Левадне",
  "1420355109, Донецька область, Олександрівський район, Новополтавка",
  "1420355113, Донецька область, Олександрівський район, Софіївка",
  "1420386805, Донецька область, Олександрівський район, Зелене",
  "1420386807, Донецька область, Олександрівський район, Карпівка",
  "1420386813, Донецька область, Олександрівський район, Новопригоже",
  "1420386903, Донецька область, Олександрівський район, Голубівка",
  "1420386905, Донецька область, Олександрівський район, Громова Балка",
  "1420381003, Донецька область, Олександрівський район, Дмитроколине",
  "1420381009, Донецька область, Олександрівський район, Роздолля",
  "1420382203, Донецька область, Олександрівський район, Запаро-Мар\'ївка",
  "1420385501, Донецька область, Олександрівський район, Михайлівка",
  "1420385503, Донецька область, Олександрівський район, Львівка",
  "1420386701, Донецька область, Олександрівський район, Некременне",
  "1420388001, Донецька область, Олександрівський район, Староварварівка",
  "1420386605, Донецька область, Олександрівський район, Знаменівка",
  "1420386601, Донецька область, Олександрівський район, Микільське",
  "1420384403, Донецька область, Олександрівський район, Бузинівка",
  "1420355100, Донецька область, Олександрівський район, Олександрівка",
  "1420355107, Донецька область, Олександрівський район, Надеждівка",
  "1420381001, Донецька область, Олександрівський район, Беззаботівка",
  "1420381007, Донецька область, Олександрівський район, Новостепанівка",
  "1420386901, Донецька область, Олександрівський район, Очеретине",
  "1420382201, Донецька область, Олександрівський район, Високопілля",
  "1420388003, Донецька область, Олександрівський район, Яковлівка",
  "1420355101, Донецька область, Олександрівський район, Варварівка",
  "1420355111, Донецька область, Олександрівський район, Петрівка Перша",
  "1420386609, Донецька область, Олександрівський район, Петрівка Друга",
  "1420386607, Донецька область, Олександрівський район, Пасічне",
  "1420386801, Донецька область, Олександрівський район, Новоолександрівка",
  "1420386811, Донецька область, Олександрівський район, Новобахметьєве",
  "1420384401, Донецька область, Олександрівський район, Мирна Долина",
  "1420384411, Донецька область, Олександрівський район, Новознаменівка",
  "1420383501, Донецька область, Олександрівський район, Золоті Пруди",
  "1420385505, Донецька область, Олександрівський район, Шаврове",
  "1420386803, Донецька область, Олександрівський район, Єлизаветівка",
  "1420386809, Донецька область, Олександрівський район, Новий Кавказ",
  "1420384409, Донецька область, Олександрівський район, Мар\'ївка",
  "1420355103, Донецька область, Олександрівський район, Дмитро-Дар\'євка",
  "1420386603, Донецька область, Олександрівський район, Зелений Брід"
];
const grom55101 = [
  "1420387503, Донецька область, Олександрівський район, Новоіверське",
  "1420387003, Донецька область, Олександрівський район, Весела Гора",
  "1420387001, Донецька область, Олександрівський район, Самарське",
  "1420387310, Донецька область, Олександрівський район, Шевченко",
  "1420387009, Донецька область, Олександрівський район, Новоявленка",
  "1422756304, Донецька область, Покровський район, Новосергіївка",
  "1411545600, Донецька область, Добропілля, Новодонецьке",
  "1420383301, Донецька область, Олександрівський район, Іверське",
  "1420387304, Донецька область, Олександрівський район, Курицине",
  "1420387505, Донецька область, Олександрівський район, Новопавлівка",
  "1420387303, Донецька область, Олександрівський район, Катеринівка",
  "1420383801, Донецька область, Олександрівський район, Криниці",
  "1420383303, Донецька область, Олександрівський район, Новосамарське",
  "1420387507, Донецька область, Олександрівський район, Самійлівка",
  "1420387501, Донецька область, Олександрівський район, Степанівка",
  "1420383305, Донецька область, Олександрівський район, Шостаківка",
  "1420387305, Донецька область, Олександрівський район, Новопетрівка",
  "1420383815, Донецька область, Олександрівський район, Федорівка",
  "1420383803, Донецька область, Олександрівський район, Куроєдівка",
  "1420387301, Донецька область, Олександрівський район, Спасько-Михайлівка"
];
const grom56100 = [
  "1421785005, Донецька область, Нікольський район, Назарівка",
  "1421787004, Донецька область, Нікольський район, Перемога",
  "1421785506, Донецька область, Нікольський район, Новороманівка",
  "1421781801, Донецька область, Нікольський район, Зелений Яр",
  "1421785007, Донецька область, Нікольський район, Українка",
  "1421785003, Донецька область, Нікольський район, Кальчинівка",
  "1421786601, Донецька область, Нікольський район, Темрюк",
  "1421787002, Донецька область, Нікольський район, КРИНИЧНЕ",
  "1421787003, Донецька область, Нікольський район, Первомайське",
  "1421781102, Донецька область, Нікольський район, Малинівка",
  "1421787003, Донецька область, Нікольський район, Первомайське",
  "1421781102, Донецька область, Нікольський район, Малинівка",
  "1421781802, Донецька область, Нікольський район, Веселе",
  "1421787005, Донецька область, Нікольський район, Шевченко",
  "1421785001, Донецька область, Нікольський район, Новокраснівка",
  "1421781101, Донецька область, Нікольський район, Бойове",
  "1421785503, Донецька область, Нікольський район, Ксенівка",
  "1421755100, Донецька область, Нікольський район, НІКОЛЬСЬКЕ",
  "1421781104, Донецька область, Нікольський район, Паннівка",
  "1421781804, Донецька область, Нікольський район, Садове",
  "1421785501, Донецька область, Нікольський район, Республіка",
  "1421787001, Донецька область, Нікольський район, Тополине",
  "1421781805, Донецька область, Нікольський район, Федорівка",
  "1421755101, Донецька область, Нікольський район, Лісне",
  "1421781803, Донецька область, Нікольський район, Лугове",
  "1421755102, Донецька область, Нікольський район, Новоянисоль",
  "1421785507, Донецька область, Нікольський район, Сергіївка"
];
const grom56101 = [
  "1421783304, Донецька область, Нікольський район, Кременівка",
  "1421784401, Донецька область, Нікольський район, Малоянісоль",
  "1421783301, Донецька область, Нікольський район, Касянівка",
  "1421781603, Донецька область, Нікольський район, Гранітне",
  "1421783302, Донецька область, Нікольський район, Македонівка",
  "1421784403, Донецька область, Нікольський район, Труженка",
  "1421781601, Донецька область, Нікольський район, Зоря",
  "1421784402, Донецька область, Нікольський район, Катеринівка",
  "1421783303, Донецька область, Нікольський район, Ключове",
  "1421781602, Донецька область, Нікольський район, Водяне",
  "1421783309, Донецька область, Нікольський район, Херсонес",
  "1421783305, Донецька область, Нікольський район, Асланове",
  "1421782202, Донецька область, Нікольський район, Кирилівка",
  "1421782203, Донецька область, Нікольський район, КЕЛЕРІВКА",
  "1421781604, Донецька область, Нікольський район, Приовражне",
  "1421782201, Донецька область, Нікольський район, Кальчик"
];
const grom56900 = [
  "1423383004, Донецька область, Мар\'їнський район, Олександропіль",
  "1423310400, Донецька область, Мар\'їнський район, Красногорівка",
  "1423383501, Донецька область, Мар\'їнський район, Катеринівка",
  "1423382501, Донецька область, Мар\'їнський район, Єлизаветівка",
  "1423383002, Донецька область, Мар\'їнський район, Желанне Перше",
  "1423382502, Донецька область, Мар\'їнський район, Іллінка",
  "1423385201, Донецька область, Мар\'їнський район, Новомихайлівка",
  "1423383003, Донецька область, Мар\'їнський район, Желанне Друге",
  "1423384001, Донецька область, Мар\'їнський район, Костянтинівка",
  "1423385202, Донецька область, Мар\'їнський район, Парасковіївка",
  "1423383502, Донецька область, Мар\'їнський район, Антонівка",
  "1423385002, Донецька область, Мар\'їнський район, Георгіївка",
  "1423383001, Донецька область, Мар\'їнський район, Зоряне",
  "1423385001, Донецька область, Мар\'їнський район, Максимільянівка",
  "1423310100, Донецька область, Мар\'їнський район, Мар\'їнка",
  "1423310101, Донецька область, Мар\'їнський район, Побєда",
  "1423382503, Донецька область, Мар\'їнський район, Романівка"
];
const grom56901 = [
  "1423310603, Донецька область, Мар'їнський район, Степанівка",
  "1413870300, Донецька область, Селидове, Гірник",
  "1423385404, Донецька область, Мар'їнський район, Ізмайлівка",
  "1423310601, Донецька область, Мар'їнський район, Острівське",
  "1423385403, Донецька область, Мар'їнський район, Вознесенка",
  "1423388503, Донецька область, Мар'їнський район, Ганнівка",
  "1423310602, Донецька область, Мар'їнський район, Старі Терни",
  "1423385405, Донецька область, Мар'їнський район, Кремінна Балка",
  "1423381501, Донецька область, Мар'їнський район, Дачне",
  "1423381505, Донецька область, Мар'їнський район, Костянтинопольське",
  "1423388502, Донецька область, Мар'їнський район, Веселий Гай",
  "1423385401, Донецька область, Мар'їнський район, Новоселидівка",
  "1423385402, Донецька область, Мар'їнський район, Вовчанка",
  "1422782304, Донецька область, Покровський район, Новодмитрівка",
  "1422782301, Донецька область, Покровський район, Сонцівка",
  "1423381503, Донецька область, Мар'їнський район, Дальнє",
  "1423381507, Донецька область, Мар'їнський район, Янтарне",
  "1423381504, Донецька область, Мар'їнський район, Зеленівка",
  "1423382502, Донецька область, Мар'їнський район, Іллінка",
  "1423310600, Донецька область, Мар'їнський район, Курахове",
  "1413846200, Донецька область, Селидове, Гостре",
  "1423381502, Донецька область, Мар'їнський район, Гігант",
  "1422782303, Донецька область, Покровський район, Зоря",
  "1423381506, Донецька область, Мар'їнський район, Сухі Яли",
  "1423388501, Донецька область, Мар'їнський район, Успенівка",
  "1422782302, Донецька область, Покровський район, Берестки",
  "1423388504, Донецька область, Мар'їнський район, Трудове",
  "1413845900, Донецька область, Селидове, Курахівка"
];
const grom57300 = [
  "1423955500",
  "1423984401",
  "1423955100",
  "1423984406",
  "1423955502",
  "1423984404",
  "1423983301",
  "1423985501",
  "1423984405",
  "1423984403",
  "1423955501",
  "1423985502",
  "1423984402",
  "1423983302",
  "1423986602",
  "1423986601",
  "1423983303",
];
const grom58500 = [
  "1422783409, Донецька область, Покровський район, Маринівка",
  "1422755603, Донецька область, Покровський район, Миколаївка",
  "1422783413, Донецька область, Покровський район, Орлівка",
  "1413845600, Донецька область, Селидове, Комишівка",
  "1422783206, Донецька область, Покровський район, Мемрик",
  "1422783415, Донецька область, Покровський район, Птиче",
  "1423381101, Донецька область, Мар\'їнський район, Галицинівка",
  "1422783405, Донецька область, Покровський район, Завітне",
  "1422783407, Донецька область, Покровський район, Калинове",
  "1423381104, Донецька область, Мар\'їнський район, Лісівка",
  "1422783201, Донецька область, Покровський район, Михайлівка",
  "1422783411, Донецька область, Покровський район, Новожеланне",
  "1423381102, Донецька область, Мар\'їнський район, Долинівка",
  "1423381103, Донецька область, Мар\'їнський район, Карлівка",
  "1413600000, Донецька область, Новогродівка"
];

class ChoiceSearchController extends GetxController {
  List vacancy0 = [];
  List<Vac> vacancy = <Vac>[].obs;
  List<Vac> filteredVac = <Vac>[].obs;
  List<Vac> filteredVac0 = <Vac>[].obs;
  List vacancy00 = [].obs;
  List vacancy01 = [].obs;
  RxBool isLoading = true.obs;
  RxBool isLoad = false.obs;
  late dynamic value;
  late List gromada = [].obs;

  final HiveService hiveService = HiveService();
  @override
  Future<void> onInit() async {
    // Hive.registerAdapter(VacAdapter());
    await Hive.initFlutter();
    // Hive.registerAdapter(VacAdapter());
    await Hive.openBox("vacancy");

    value = Get.arguments;
    gromada = int.parse(value) == 50300
        ? grom50300
        : int.parse(value) == 50301
            ? grom50301
            : int.parse(value) == 50500
                ? grom50500
                : int.parse(value) == 50501
                    ? grom50501
                    : int.parse(value) == 50502
                        ? grom50502
                        : int.parse(value) == 50503
                            ? grom50503
                            : int.parse(value) == 50504
                                ? grom50504
                                : int.parse(value) == 50505
                                    ? grom50505
                                    : int.parse(value) == 51100
                                        ? grom51100
                                        : int.parse(value) == 51300
                                            ? grom51300
                                            : int.parse(value) == 51500
                                                ? grom51500
                                                : int.parse(value) == 51501
                                                    ? grom51501
                                                    : int.parse(value) == 51502
                                                        ? grom51502
                                                        : int.parse(value) ==
                                                                51503
                                                            ? grom51503
                                                            : int.parse(value) ==
                                                                    51700
                                                                ? grom51700
                                                                : int.parse(value) ==
                                                                        52300
                                                                    ? grom52300
                                                                    : int.parse(value) ==
                                                                            52301
                                                                        ? grom52301
                                                                        : int.parse(value) ==
                                                                                52500
                                                                            ? grom52500
                                                                            : int.parse(value) == 52700
                                                                                ? grom52700
                                                                                : int.parse(value) == 52701
                                                                                    ? grom52701
                                                                                    : int.parse(value) == 52702
                                                                                        ? grom52702
                                                                                        : int.parse(value) == 52900
                                                                                            ? grom52900
                                                                                            : int.parse(value) == 53300
                                                                                                ? grom53300
                                                                                                : int.parse(value) == 53301
                                                                                                    ? grom53301
                                                                                                    : int.parse(value) == 53500
                                                                                                        ? grom53500
                                                                                                        : int.parse(value) == 53700
                                                                                                            ? grom53700
                                                                                                            : int.parse(value) == 53701
                                                                                                                ? grom53701
                                                                                                                : int.parse(value) == 53702
                                                                                                                    ? grom53702
                                                                                                                    : int.parse(value) == 53703
                                                                                                                        ? grom53703
                                                                                                                        : int.parse(value) == 53704
                                                                                                                            ? grom53704
                                                                                                                            : int.parse(value) == 54300
                                                                                                                                ? grom54300
                                                                                                                                : int.parse(value) == 55100
                                                                                                                                    ? grom55100
                                                                                                                                    : int.parse(value) == 55101
                                                                                                                                        ? grom55101
                                                                                                                                        : int.parse(value) == 55700
                                                                                                                                            ? grom55700
                                                                                                                                            : int.parse(value) == 55701
                                                                                                                                                ? grom55701
                                                                                                                                                : int.parse(value) == 55702
                                                                                                                                                    ? grom55702
                                                                                                                                                    : int.parse(value) == 55900
                                                                                                                                                        ? grom55900
                                                                                                                                                        : int.parse(value) == 55901
                                                                                                                                                            ? grom55901
                                                                                                                                                            : int.parse(value) == 55902
                                                                                                                                                                ? grom55902
                                                                                                                                                                : int.parse(value) == 55903
                                                                                                                                                                    ? grom55903
                                                                                                                                                                    : int.parse(value) == 56100
                                                                                                                                                                        ? grom56100
                                                                                                                                                                        : int.parse(value) == 56101
                                                                                                                                                                            ? grom56101
                                                                                                                                                                            : int.parse(value) == 56900
                                                                                                                                                                                ? grom56900
                                                                                                                                                                                : int.parse(value) == 56901
                                                                                                                                                                                    ? grom56901
                                                                                                                                                                                    : int.parse(value) == 57300
                                                                                                                                                                                        ? grom57300
                                                                                                                                                                                        : int.parse(value) == 58500
                                                                                                                                                                                            ? grom58500
                                                                                                                                                                                            : [];
    // vacancy00 = await hiveService.getBoxes("vacancy");
    // print("Getting vacgrom ${vacancy00.length}");
    //  vacancy00.length == 0 ?
    fetchVac();
    //: getLocal();
    // fetchVac();

    super.onInit();
  }

  /* getLocal() async {
    vacancy01 = await hiveService.getBoxes("vacancy");
    vacancy01.length != null ? isLoading.value = false : isLoading.value = true;
    print("Getting data from Hive01");
    print("Getting vacancygrom ${vacancy01.length}");
    fetchVac();
  }*/

  void fetchVac() async {
    vacancy00 = await hiveService.getBoxes("vacancy");
    print("Getting vacgrom ${vacancy00.length}");
    try {
      if (vacancy00.length != 0) {
        vacancy0 = await hiveService.getBoxes("vacancy");
        print("Getting data from Hive2");
      } else {
        vacancy0 = (await VacRepository.getAllVac());
        print("Getting data from API");
      }
      // vacancy0 = (await VacRepository.getAllVac());
      vacancy0.forEach((item) {
        print(item.placevac.substring(0, 10));

        for (int i = 0; i < gromada.length; i++)
          if (item.placevac.substring(0, 10) == gromada[i]) {
            vacancy.add(item);
            print("tt" + item.placevac.substring(0, 10));
          }
      });
    } finally {
      isLoading.value = false;
      if (vacancy.length == 0) {
        Get.snackbar(
          "Онлайн помічник", // title
          "На жаль,на даний час вакансії  по Вашій громаді відсутні", // message
          icon: Icon(Icons.alarm),
          shouldIconPulse: true,
          colorText: HexColor('#005BAA'),
          backgroundColor: Colors.amber,
          barBlur: 20,
          snackPosition: SnackPosition.TOP,
          isDismissible: true,
          duration: Duration(seconds: 3),
        );
      }
    }
  }

  filteredVacancy(value) {
    filteredVac = vacancy
        .where((item) =>
            (item.posadavac.toLowerCase().contains(value.toLowerCase()) ||
                item.salaryvac.toLowerCase().contains(value.toLowerCase())))
        .toList();
    //  filteredVac.add( filteredVac0 );
    // filteredVac.sort;
    // filter();
    print(filteredVac);
    print(filteredVac.length);

    /*  for (int i = 0; i < filteredVac0.length; i++) {
        var item =filteredVac0[i];
      filteredVac.add(item);

  };*/
// print(filteredVac0);
    //print(filteredVac0.length);
  }
}
