import 'package:get/get.dart';
import 'package:gromada/Pages/Search/models/vac.dart';
import 'package:gromada/Pages/services/VacDepository.dart';

const grom55900 = [
  "1421510100, Донецька область, Волноваський район, Волноваха",
  "1421555900, Донецька область, Волноваський район, Донське",
  "1421587201, Донецька область, Волноваський район, Рибинське",
  "1421581201, Донецька область, Волноваський район, Валер'янівка",
  "1421583601, Донецька область, Волноваський район, Бугас",
  "1421587202, Донецька область, Волноваський район, Ближнє",
  "1421581401, Донецька область, Волноваський район, Дмитрівка",
  "1421582801, Донецька область, Волноваський район, Іванівка",
  "1421587601, Донецька область, Волноваський район, Свободне",
  "1421586401, Донецька область, Волноваський район, Прохорівка",
  "1421584801, Донецька область, Волноваський район, Новоандріївка",
  "1421581202, Донецька область, Волноваський район, Благовіщенка",
  "1421586404, Донецька область, Волноваський район, Новоапостолівка",
  "1421586402, Донецька область, Волноваський район, Малогнатівка",
  "1421584802, Донецька область, Волноваський район, Кирилівка",
  "1421510101, Донецька область, Волноваський район, Новогригорівка",
  "1421586403, Донецька область, Волноваський район, Тарасівка",
  "1421582802, Донецька область, Волноваський район, Новотатарівка",
  "1421587203, Донецька область, Волноваський район, Василівка",
  "1421586404, Донецька область, Волноваський район, Новоапостолівка",
  "1421587204, Донецька область, Волноваський район, Трудівське",
  "1421581203, Донецька область, Волноваський район, Зелений Гай",
];
const grom55901 = [
  "1421555600, Донецька область, Волноваський район, Володимирівка",
  "1421556800, Донецька область, Волноваський район, Новотроїцьке",
  "1421557200, Донецька область, Волноваський район, Ольгинка",
  "1421555300, Донецька область, Волноваський район, Благодатне",
  "1421556500, Донецька область, Волноваський район, Графське",
  "1421584003, Донецька область, Волноваський район, Вікторівка",
  "1421584002, Донецька область, Волноваський район, Богданівка",
  "1421584004, Донецька область, Волноваський район, Новогнатівка",
  "1421557202, Донецька область, Волноваський район, Пільне",
  "1421557201, Донецька область, Волноваський район, Лісне",
  "1421584001, Донецька область, Волноваський район, Миколаївка",
];
const grom55902 = [
  "1421580401, Донецька область, Волноваський район, Анадоль",
  "1421583101, Донецька область, Волноваський район, ДІАНІВКА",
  "1421581301, Донецька область, Волноваський район, Вільне",
  "1421582001, Донецька область, Волноваський район, Зачатівка",
  "1421582401, Донецька область, Волноваський район, Златоустівка",
  "1421583001, Донецька область, Волноваський район, Калинове",
  "1421580404, Донецька область, Волноваський район, Полкове",
  "1421587903, Донецька область, Волноваський район, Кропивницьке",
  "1421584701, Донецька область, Волноваський район, Новоолексіївка",
  "1421582406, Донецька область, Волноваський район, Новомиколаївка",
  "1421582403, Донецька область, Волноваський район, Голубицьке",
  "1421582003, Донецька область, Волноваський район, Зачатівка",
  "1421583202, Донецька область, Волноваський район, Знаменівка",
  "1421584703, Донецька область, Волноваський район, Лідине",
  "1421582403, Донецька область, Волноваський район, Голубицьке",
  "1421585604, Донецька область, Волноваський район, ПЕТРІВКА",
  "1421582402, Донецька область, Волноваський район, Веселе",
  "1421586802, Донецька область, Волноваський район, Передове",
  "1421583202, Донецька область, Волноваський район, Знаменівка",
  "1421586301, Донецька область, Волноваський район, Привільне",
  "1421585603, Донецька область, Волноваський район, ЛАЗАРІВКА",
  "1421582405, Донецька область, Волноваський район, Малинівка",
  "1421582404, Донецька область, Волноваський район, Затишне",
  "1421586801, Донецька область, Волноваський район, Рівнопіль",
  "1421583201, Донецька область, Волноваський район, Сонячне",
  "1421587901, Донецька область, Волноваський район, Степне",
  "1421585601, Донецька область, Волноваський район, СТРІТЕНКА",
  "1421588001, Донецька область, Волноваський район, Хлібодарівка",
];
const grom55903 = [
  "1421580801, Донецька область, Волноваський район, Андріївка",
  "1421589203, Донецька область, Волноваський район, Кам'янка",
  "1421587700, Донецька область, Волноваський район, СТАРОГНАТІВСЬКА/С.СТАРОГНАТІВКА",
  "1421587702, Донецька область, Волноваський район, Новогригорівка",
  "1421588800, Донецька область, Волноваський район, ГРАНІТНЕНСЬКА/С.ГРАНІТНЕ",
  "1421589204, Донецька область, Волноваський район, Маловодне",
  "1421589206, Донецька область, Волноваський район, Степанівка",
  "1421555101, Донецька область, Волноваський район, Бахчовик",
  "1421589202, Донецька область, Волноваський район, Запорізьке",
  "1421589200, Донецька область, Волноваський район, НОВОСЕЛІВСЬКА/С.НОВОСЕЛІВКА",
  "1421589205, Донецька область, Волноваський район, Новоселівка Друга",
  "1421555102, Донецька область, Волноваський район, Дружне",
  "1421589201, Донецька область, Волноваський район, Новоселівка",
  "1421555103, Донецька область, Волноваський район, Обільне",
  "1421588802, Донецька область, Волноваський район, Старомар'Ївка",
  "1421588801, Донецька область, Волноваський район, Гранітне",
  "1421556600, Донецька область, Волноваський район, Мирне",
  "1421587701, Донецька область, Волноваський район, Старогнатівка",
];
const grom54300 = [
  "1414890002, Донецька область, Вугледар, Водяне",
  "1414890003, Донецька область, Вугледар, Павлівка",
  "1423385801, Донецька область, Мар'їнський район, Новоукраїнка",
  "1414890004, Донецька область, Вугледар, Солодке",
  "1421581601, Донецька область, Волноваський район, Єгорівка",
  "1414800000, Донецька область, Вугледар",
  "1423385803, Донецька область, Мар'їнський район, Пречистівка",
  "1421586001, Донецька область, Волноваський район, Петрівське",
  "1421584401, Донецька область, Волноваський район, Микільське",
  "1423382001, Донецька область, Мар'їнський район, Мар'їнський район, БОГОЯВЛЕНКА",
  "1421581602, Донецька область, Волноваський район, Шевченко",
  "1414890006, Донецька область, Вугледар, Тарамчук",
  "1423385802, Донецька область, Мар'їнський район, Максимівка",
  "1414890005, Донецька область, Вугледар, Степне",
  "1414890001, Донецька область, Вугледар, Березове",
];
const grom55700 = [
  "1421285204, Донецька область, Великоновосілківський район, Ключове",
  "1421283604, Донецька область, Великоновосілківський район, Ялинське",
  "1421283602, Донецька область, Великоновосілківський район, Георгієвка",
  "1421283603, Донецька область, Великоновосілківський район, Малий Керменчик",
  "1421284002, Донецька область, Великоновосілківський район, Новодонецьке",
  "1421284003, Донецька область, Великоновосілківський район, Новомайорське",
  "1421285202, Донецька область, Великоновосілківський район, Володине",
  "1421283601, Донецька область, Великоновосілківський район, Новопетриківка",
  "1421281201, Донецька область, Великоновосілківський район, Євгенівка",
  "1421285205, Донецька область, Великоновосілківський район, Орлинське",
  "1421285203, Донецька область, Великоновосілківський район, Завітне Бажання",
  "1421283001, Донецька область, Великоновосілківський район, Красна Поляна",
  "1421284001, Донецька область, Великоновосілківський район, Керменчик",
  "1421285201, Донецька область, Великоновосілківський район, Старомлинівка",
];
const grom55701 = [
  "1421286602, Донецька область, Великоновосілківський район, Бурлацьке",
  "1421282402, Донецька область, Великоновосілківський район, Веселе",
  "1421282408, Донецька область, Великоновосілківський район, Ялта",
  "1421284404, Донецька область, Великоновосілківський район, Новохатське",
  "1421286604, Донецька область, Великоновосілківський район, Воскресенка",
  "1421286605, Донецька область, Великоновосілківський район, Комишуваха",
  "1421284406, Донецька область, Великоновосілківський район, Толстой",
  "1421284401, Донецька область, Великоновосілківський район, Піддубне",
  "1421281802, Донецька область, Великоновосілківський район, Зелений Гай",
  "1421282407, Донецька область, Великоновосілківський район, ЗІРКА",
  "1421282401, Донецька область, Великоновосілківський район, Комар",
  "1421284402, Донецька область, Великоновосілківський район, Грушівське",
  "1421286603, Донецька область, Великоновосілківський район, Вільне Поле",
  "1421282403, Донецька область, Великоновосілківський район, Дніпроенергія",
  "1421281801, Донецька область, Великоновосілківський район, Іскра",
  "1421282405, Донецька область, Великоновосілківський район, Новоочеретувате",
  "1421286607, Донецька область, Великоновосілківський район, Привільне",
  "1421282404, Донецька область, Великоновосілківський район, Запоріжжя",
  "1421284405, Донецька область, Великоновосілківський район, Перебудова",
  "1421286601, Донецька область, Великоновосілківський район, Шевченко",
  "1421286606, Донецька область, Великоновосілківський район, Олександроград",
  "1421282406, Донецька область, Великоновосілківський район, Федорівка",
  "1421284403, Донецька область, Великоновосілківський район, МИРНЕ",
];
const grom55702 = [
  "1421280202, Донецька область, Великоновосілківський район, Петропавлівка",
  "1421281402, Донецька область, Великоновосілківський район, Новопіль",
  "1421281401, Донецька область, Великоновосілківський район, Зелене Поле",
  "1421255102, Донецька область, Великоновосілківський район, Нескучне",
  "1421255103, Донецька область, Великоновосілківський район, Новий Комар",
  "1421284802, Донецька область, Великоновосілківський район, Макарівка",
  "1421280204, Донецька область, Великоновосілківський район, Шевченко",
  "1421282701, Донецька область, Великоновосілківський район, Костянтинопіль",
  "1421284804, Донецька область, Великоновосілківський район, Сторожеве",
  "1421255100, Донецька область, Великоновосілківський район, Велика Новосілка",
  "1421286401, Донецька область, Великоновосілківський район, Шахтарське",
  "1421281403, Донецька область, Великоновосілківський район, Новосілка",
  "1421255104, Донецька область, Великоновосілківський район, БЛАГОДАТНЕ",
  "1421280802, Донецька область, Великоновосілківський район, Зелений Кут",
  "1421280805, Донецька область, Великоновосілківський район, Олексіївка",
  "1421282703, Донецька область, Великоновосілківський район, Улакли",
  "1421286403, Донецька область, Великоновосілківський район, Ясна Поляна",
  "1421286402, Донецька область, Великоновосілківський район, Золота Нива",
  "1421280201, Донецька область, Великоновосілківський район, Андрієвка",
  "1421280801, Донецька область, Великоновосілківський район, Багатир",
  "1421284803, Донецька область, Великоновосілківський район, Рівнопіль",
  "1421284805, Донецька область, Великоновосілківський район, Урожайне",
  "1421284801, Донецька область, Великоновосілківський район, Старомайорське",
  "1421284603, Донецька область, Великоновосілківський район, Відрадне",
  "1421280203, Донецька область, Великоновосілківський район, Слов'янка",
  "1421284601, Донецька область, Великоновосілківський район, Роздольне",
  "1421280803, Донецька область, Великоновосілківський район, Новоукраїнка",
  "1421282702, Донецька область, Великоновосілківський район, Розлив",
  "1421255101, Донецька область, Великоновосілківський район, Времівка",
];
const grom50300 = [
  "1425587606,  Донецька область, Ясинуватський район, Опитне",
  "1410200000,  Донецька область, Авдіївка"
];
const grom50301 = [
  "1425584305,  Донецька область, Ясинуватський район, Семенівка",
  "1425584306,  Донецька область, Ясинуватський район, Тоненьке",
  "1425586504,  Донецька область, Ясинуватський район, Пантелеймонівка",
  "1425587305,  Донецька область, Ясинуватський район, Новобахмутівка",
  "1425582104,  Донецька область, Ясинуватський район, Новоселівка Друга",
  "1425583201,  Донецька область, Ясинуватський район, Новоселівка Перша",
  "1425583205,  Донецька область, Ясинуватський район, Скучне	Актуальний",
  "1425587303,  Донецька область, Ясинуватський район, Архангельське",
  "1425584301,  Донецька область, Ясинуватський район, Орлівка",
  "1425585601,  Донецька область, Ясинуватський район, Піски",
  "1425584304,  Донецька область, Ясинуватський район, Степове",
  "1425586503,  Донецька область, Ясинуватський район, Новоселівка",
  "1425585604,  Донецька область, Ясинуватський район, Сєверне",
  "1425587309,  Донецька область, Ясинуватський район, Сокіл",
  "1425583203,  Донецька область, Ясинуватський район, Межове",
  "1425585401,  Донецька область, Ясинуватський район, Первомайське",
  "1425584307,  Донецька область, Ясинуватський район, Уманське",
  "1425584303,  Донецька область, Ясинуватський район, Ласточкине",
  "1425584308,  Донецька область, Ясинуватський район, Яснобродівка",
  "1425555201,  Донецька область, Ясинуватський район, Василівка",
  "1425585603,  Донецька область, Ясинуватський район, Лозове	Актуальний",
  "1425555202,  Донецька область, Ясинуватський район, Бетманове",
  "1425582102,  Донецька область, Ясинуватський район, Веселе",
  "1425555301,  Донецька область, Ясинуватський район, Восход",
  "1425555900,  Донецька область, Ясинуватський район, Очеретине",
  "1425587301,  Донецька область, Ясинуватський район, Соловйове",
  "1425585602,  Донецька область, Ясинуватський район, Водяне",
  "1425555600,  Донецька область, Ясинуватський район, Керамік",
  "1425555200,  Донецька область, Ясинуватський район, Верхньоторецьке",
  "1425586501,  Донецька область, Ясинуватський район, Олександропіль",
  "1425582101,  Донецька область, Ясинуватський район, Красногорівка",
  "1425555203,  Донецька область, Ясинуватський район, Троїцьке",
  "1425585402,  Донецька область, Ясинуватський район, Невельське",
  "1425585403,  Донецька область, Ясинуватський район, Нетайлове",
  "1425587307,  Донецька область, Ясинуватський район, Новокалинове",
  "1425583101,  Донецька область, Ясинуватський район, Новобахмутівка",
  "1425584302,  Донецька область, Ясинуватський район, Бердичі",
  "1425555300,  Донецька область, Ясинуватський район, Желанне",
  "1425582103,  Донецька область, Ясинуватський район, Кам\'янка",
  "1425583204,  Донецька область, Ясинуватський район, Новопокровське"
];

const grom50500 = [
  "1420986509,  Донецька область, Бахмутський район, ЯГІДНЕ",
  "1420985500,  Донецька область, Бахмутський район, ІВАНІВСЬКА/С.ІВАНІВСЬКЕ",
  "1420986501,  Донецька область, Бахмутський район, ОПИТНЕ",
  "1420984502,  Донецька область, Бахмутський район, ВІДРОДЖЕННЯ",
  "1420984503,  Донецька область, Бахмутський район, МІДНА РУДА",
  "1420983001,  Донецька область, Бахмутський район, ЗАЙЦЕВЕ",
  "1420983002,  Донецька область, Бахмутський район, ВЕРШИНА",
  "1420984501,  Донецька область, Бахмутський район, КЛИНОВЕ",
  "1410300000,  Донецька область, Бахмут",
  "1410345600,  Донецька область, Бахмут, Красна Гора",
  "1420985502,  Донецька область, Бахмутський район, АНДРІЇВКА",
  "1420985504,  Донецька область, Бахмутський район, БЕРХІВКА",
  "1420986503,  Донецька область, Бахмутський район, ЗЕЛЕНОПІЛЛЯ",
  "1420986505,  Донецька область, Бахмутський район, ІВАНГРАД",
  "1420987501,  Донецька область, Бахмутський район, ПОКРОВСЬКЕ",
  "1420985505,  Донецька область, Бахмутський район, КЛІЩІЇВКА",
  "1420983003,  Донецька область, Бахмутський район, ВЕСЕЛА ДОЛИНА",
  "1420987503,  Донецька область, Бахмутський район, НОВА КАМ\'ЯНКА"
];
const grom50501 = [
  "1420981501,  Донецька область, Бахмутський район, ВЕРХНЬОКАМ'ЯНСЬКЕ",
  "1420983501,  Донецька область, Бахмутський район, ЗВАНІВКА",
  "1420983502,  Донецька область, Бахмутський район, КУЗЬМИНІВКА",
  "1420981503,  Донецька область, Бахмутський район, НОВОСЕЛІВКА",
  "1420981502,  Донецька область, Бахмутський район, ІВАНО-ДАР\'ЇВКА",
  "1420983503,  Донецька область, Бахмутський район, ПЕРЕЇЗНЕ",
];
const grom50502 = [
  "1420985004,  Донецька область, Бахмутський район, МИКОЛАЇВКА ДРУГА",
  "1420955401,  Донецька область, Бахмутський район, ВОЗДВИЖЕНКА",
  "1420955400,  Донецька область, Бахмутський район, ЛУГАНСЬКЕ",
  "1420985005,  Донецька область, Бахмутський район, ОДРАДІВКА",
  "1420955404,  Донецька область, Бахмутський район, МИРОНІВКА",
  "1420986201,  Донецька область, Бахмутський район, НОВОЛУГАНСЬКЕ",
  "1420985002,  Донецька область, Бахмутський район, ДАЧА",
  "1420955500,  Донецька область, Бахмутський район, Миронівський",
  "1420986205,  Донецька область, Бахмутський район, Гладосове",
  "1420955405,  Донецька область, Бахмутський район, РОЗСАДКИ",
  "1420955402,  Донецька область, Бахмутський район, КРИНИЧНЕ",
  "1420985001,  Донецька область, Бахмутський район, КОДЕМА",
  "1420910818,  Донецька область, Бахмутський район, МИКОЛАЇВКА",
  "1420955403,  Донецька область, Бахмутський район, ЛОЗОВЕ",
  "1420986202,  Донецька область, Бахмутський район, ДОЛОМІТНЕ",
  "1420986203,  Донецька область, Бахмутський район, СЕМИГІР\'Я",
  "1420986204,  Донецька область, Бахмутський район, ТРАВНЕВЕ",
  "1420910600,  Донецька область, Бахмутський район, Світлодарськ",
  "1420955406,  Донецька область, Бахмутський район, РОТИ"
];
const grom50503 = [
  "1420910400,  Донецька область, Бахмутський район, СІВЕРСЬК",
  "1420982303,  Донецька область, Бахмутський район, ПЛАТОНІВКА",
  "1420982301,  Донецька область, Бахмутський район, ДРОНІВКА",
  "1420988402,  Донецька область, Бахмутський район, СВЯТО-ПОКРОВСЬКЕ",
  "1420983903,  Донецька область, Бахмутський район, ГРИГОРІВКА",
  "1420989201,  Донецька область, Бахмутський район, СЕРЕБРЯНКА",
  "1420988401,  Донецька область, Бахмутський район, РІЗНИКІВКА"
];
const grom50504 = [
  "1420980501,  Донецька область, Бахмутський район, БЕРЕСТОВЕ",
  "1420981006,  Донецька область, Бахмутський район, Пазено",
  "1420989903,  Донецька область, Бахмутський район, БІЛОГОРІВКА",
  "1420989907,  Донецька область, Бахмутський район, ВЕСЕЛЕ",
  "1420982001,  Донецька область, Бахмутський район, ВОЛОДИМИРІВКА",
  "1420985702,  Донецька область, Бахмутський район, ГОЛУБІВКА",
  "1420981008,  Донецька область, Бахмутський район, ФЕДОРІВКА",
  "1420980301,  Донецька область, Бахмутський район, БАХМУТСЬКЕ",
  "1420981002,  Донецька область, Бахмутський район, БОНДАРНЕ",
  "1420981007,  Донецька область, Бахмутський район, САККО І ВАНЦЕТТІ",
  "1420985701,  Донецька область, Бахмутський район, МІНЬКІВКА",
  "1420980508,  Донецька область, Бахмутський район, СПІРНЕ",
  "1420981010,  Донецька область, Бахмутський район, ХРОМІВКА",
  "1420985901,  Донецька область, Бахмутський район, НИКИФОРІВКА",
  "1420980505,  Донецька область, Бахмутський район, ВИЇМКА",
  "1420980507,  Донецька область, Бахмутський район, НАГІРНЕ",
  "1420981001,  Донецька область, Бахмутський район, ВАСЮКІВКА",
  "1420981008,  Донецька область, Бахмутський район, ФЕДОРІВКА",
  "1420985903,  Донецька область, Бахмутський район, ДІБРОВА",
  "1420989909,  Донецька область, Бахмутський район, ЛИПОВЕ",
  "1420982003,  Донецька область, Бахмутський район, ПИЛИПЧАТИНЕ",
  "1420982005,  Донецька область, Бахмутський район, ТРИПІЛЛЯ",
  "1420988001,  Донецька область, Бахмутський район, РОЗДОЛІВКА",
  "1420980304,  Донецька область, Бахмутський район, ПІДГОРОДНЕ",
  "1420987001,  Донецька область, Бахмутський район, ПАРАСКОВІЇВКА",
  "1420987003,  Донецька область, Бахмутський район, ЗАЛІЗНЯНСЬКЕ",
  "1420985003,  Донецька область, Бахмутський район, МИКОЛАЇВКА",
  "1420989905,  Донецька область, Бахмутський район, ВАСИЛІВКА",
  "1420910800,  Донецька область, Бахмутський район, Соледар",
  "1420982004,  Донецька область, Бахмутський район, СТРЯПІВКА",
  "1420985703,  Донецька область, Бахмутський район, ДУБОВО-ВАСИЛІВКА",
  "1420985704,  Донецька область, Бахмутський район, ОРІХОВО-ВАСИЛІВКА",
  "1420985705,  Донецька область, Бахмутський район, ПРИВІЛЛЯ",
  "1420985904,  Донецька область, Бахмутський район, ЛИПІВКА",
  "1420987002,  Донецька область, Бахмутський район, БЛАГОДАТНЕ",
  "1420989901,  Донецька область, Бахмутський район, ЯКОВЛІВКА",
  "1420988002,  Донецька область, Бахмутський район, КРАСНОПОЛІВКА"
];
const grom50505 = [
  "1420983902,  Донецька область, Бахмутський район, БОГДАНІВКА",
  "1420911000,  Донецька область, Бахмутський район, Часів Яр",
  "1420985202,  Донецька область, Бахмутський район, КАЛИНІВКА",
  "1420983903,  Донецька область, Бахмутський район, ГРИГОРІВКА"
];
const grom51100 = [
  "1411246503,  Донецька область, Торецьк, Леонідівка",
  "1411247200,  Донецька область, Торецьк, Щербинівка",
  "1411245307,  Донецька область, Торецьк, ОЗАРЯНІВКА",
  "1411245300,  Донецька область, Торецьк, Північне",
  "1411290001,  Донецька область, Торецьк, Кримське",
  "1411246507,  Донецька область, Торецьк, Юр\'ївка",
  "1411245305,  Донецька область, Торецьк, Дружба",
  "1411245900,  Донецька область, Торецьк, Південне",
  "1411200000,  Донецька область, Торецьк",
  "1411246200,  Донецька область, Торецьк, Неліпівка",
  "1411245600,  Донецька область, Торецьк, Курдюмівка",
  "1411246505,  Донецька область, Торецьк, Суха Балка",
  "1411245900,  Донецька область, Торецьк, Південне",
  "1411246800,  Донецька область, Торецьк, Петрівка"
];
const grom51300 = [
  "1422785705,  Донецька область, Покровський район, Сухецьке",
  "1422785701,  Донецька область, Покровський район, Рівне",
  "1411390001,  Донецька область, Мирноград, Світле",
  "1411300000,  Донецька область, Мирноград"
];
const grom51500 = [
  "1422055501,  Донецька область, Добропільський район, Вікторівка",
  "1422088002,  Донецька область, Добропільський район, Красноярське",
  "1422088001,  Донецька область, Добропільський район, Світле",
  "1411570300,  Донецька область, Добропілля, Білицьке",
  "1422055505,  Донецька область, Добропільський район, Новоукраїнка",
  "1411500000,  Донецька область, Добропілля",
  "1422081101,  Донецька область, Добропільський район, Ганнівка",
  "1422081105,  Донецька область, Добропільський район, Рубіжне",
  "1422081103,  Донецька область, Добропільський район, Кутузівка",
  "1422088003,  Донецька область, Добропільський район, Новий Донбас",
  "1422081101,  Донецька область, Добропільський район, Ганнівка",
  "1422088004,  Донецька область, Добропільський район, Шевченко",
  "1411545300,  Донецька область, Добропілля, Водянське",
  "1422055503,  Донецька область, Добропільський район, Копані",
  "1422081105,  Донецька область, Добропільський район, Рубіжне",
  "1422081103,  Донецька область, Добропільський район, Кутузівка"
];
const grom51501 = [
  "1422084406,  Донецька область, Добропільський район, Новокриворіжжя",
  "1422084407,  Донецька область, Добропільський район, Новомар\'ївка",
  "1422084403,  Донецька область, Добропільський район, Завидо-Борзенка",
  "1422084408,  Донецька область, Добропільський район, Новофедорівка",
  "1422088805,  Донецька область, Добропільський район, МИРНЕ",
  "1422082204,  Донецька область, Добропільський район, Новогришине",
  "1422088809,  Донецька область, Добропільський район, Юр\'ївка",
  "1422084404,  Донецька область, Добропільський район, Завидо-Кудашеве",
  "1422084409,  Донецька область, Добропільський район, Ракша	Актуальний",
  "1422088804,  Донецька область, Добропільський район, Кам\'янка",
  "1422088803,  Донецька область, Добропільський район, Гуліве",
  "1422088801,  Донецька область, Добропільський район, Шилівка",
  "1422084405,  Донецька область, Добропільський район, Зелене",
  "1422088807,  Донецька область, Добропільський район, Новоолександрівка",
  "1422084401,  Донецька область, Добропільський район, Криворіжжя",
  "1422088808,  Донецька область, Добропільський район, Петрівське",
  "1422084402,  Донецька область, Добропільський район, НАДІЯ",
  "1422088806,  Донецька область, Добропільський район, Лиман",
  "1422082202,  Донецька область, Добропільський район, Красноподілля",
  "1422082201,  Донецька область, Добропільський район, Добропілля",
  "1422082203,  Донецька область, Добропільський район, Матяшеве",
  "1422088802,  Донецька область, Добропільський район, Василівка"
];
const grom51502 = [
  "1422087701,  Донецька область, Добропільський район, Шахове",
  "1422085009,  Донецька область, Добропільський район, Нове Шахове",
  "1422085011,  Донецька область, Добропільський район, Суворове",
  "1422086606,  Донецька область, Добропільський район, Коптєве",
  "1422085007,  Донецька область, Добропільський район, Іванівка",
  "1422087706,  Донецька область, Добропільський район, Торецьке",
  "1422085006,  Донецька область, Добропільський район, Дорожнє",
  "1422085015,  Донецька область, Добропільський район, Маяк",
  "1422086605,  Донецька область, Добропільський район, Володимирівка",
  "1422085001,  Донецька область, Добропільський район, Никанорівка",
  "1422085003,  Донецька область, Добропільський район, Бойківка",
  "1422085005,  Донецька область, Добропільський район, Вільне",
  "1422086601,  Донецька область, Добропільський район, Новоторецьке",
  "1422086609,  Донецька область, Добропільський район, Панківка",
  "1422087707,  Донецька область, Добропільський район, Іванівка",
  "1422087704,  Донецька область, Добропільський район, Володимирівка",
  "1422087703,  Донецька область, Добропільський район, Вільне",
  "1422087711,  Донецька область, Добропільський район, Нове Шахове",
  "1422087714,  Донецька область, Добропільський район, Суворове",
  "1422087710,  Донецька область, Добропільський район, Никанорівка",
  "1422087705,  Донецька область, Добропільський район, Дорожнє",
  "1422087712,  Донецька область, Добропільський район, Новоторецьке",
  "1422087709,  Донецька область, Добропільський район, Маяк",
  "1422087702,  Донецька область, Добропільський район, Бойківка",
  "1422087713,  Донецька область, Добропільський район, Панківка",
  "1422087708,  Донецька область, Добропільський район, Коптєве",
  "1422083305,  Донецька область, Добропільський район, Кучерів Яр",
  "1422083303,  Донецька область, Добропільський район, Грузьке",
  "1422083301,  Донецька область, Добропільський район, Золотий Колодязь",
  "1422083306,  Донецька область, Добропільський район, Новотроїцьке",
  "1422083302,  Донецька область, Добропільський район, Веселе",
  "1422083304,  Донецька область, Добропільський район, Лідине",
  "1422083311,  Донецька область, Добропільський район, ПЕТРІВКА",
  "1422083309,  Донецька область, Добропільський район, Мар\'ївка"
];
const grom51503 = [
  "1422085505,  Донецька область, Добропільський район, ВЕСНА",
  "1411570500,  Донецька область, Добропілля, Білозерське",
  "1422085502,  Донецька область, Добропільський район, Благодать",
  "1422085501,  Донецька область, Добропільський район, Нововодяне",
  "1411570501,  Донецька область, Добропілля, Бокове",
  "1422085504,  Донецька область, Добропільський район, Первомайське",
  "1422085503,  Донецька область, Добропільський район, Веселе Поле"
];
const grom51700 = [
  "1422486007,  Донецька область, Костянтинівський район, Павлівка",
  "1411745600,  Донецька область, Дружківка, Новогригорівка",
  "1411745800,  Донецька область, Дружківка, Новомиколаївка",
  "1411746201,  Донецька область, Дружківка, Красний Кут",
  "1411746200,  Донецька область, Дружківка, Райське",
  "1411700000,  Донецька область, Дружківка",
  "1411790003,  Донецька область, Дружківка, Дружківське",
  "1422483505,  Донецька область, Костянтинівський район, Осикове",
  "1422486013,  Донецька область, Костянтинівський район, Райське",
  "1422486001,  Донецька область, Костянтинівський район, Торське",
  "1422484401,  Донецька область, Костянтинівський район, СОФІЇВКА",
  "1411746203,  Донецька область, Дружківка, Старорайське",
  "1422483501,  Донецька область, Костянтинівський район, Кіндратівка",
  "1422486011,  Донецька область, Костянтинівський район, Приют",
  "1422486015,  Донецька область, Костянтинівський район, Торецьке",
  "1422483503,  Донецька область, Костянтинівський район, Куртівка",
  "1422486005,  Донецька область, Костянтинівський район, Новопавлівка",
  "1422483901,  Донецька область, Костянтинівський район, Миколайпілля",
  "1422486009,  Донецька область, Костянтинівський район, Петрівка",
];
const grom52300 = [
  "1422484103,  Донецька область, Костянтинівський район, Молочарка",
  "1422483705,  Донецька область, Костянтинівський район, Новомаркове",
  "1422484102,  Донецька область, Костянтинівський район, Іжевка",
  "1422482003,  Донецька область, Костянтинівський район, Клинове",
  "1422482002,  Донецька область, Костянтинівський район, Безімяне",
  "1422482501,  Донецька область, Костянтинівський район, Іванопілля",
  "1412600000,  Донецька область, Костянтинівка",
  "1422483701,  Донецька область, Костянтинівський район, Маркове",
  "1422482505,  Донецька область, Костянтинівський район, Олександро-Шультине",
  "1422481501,  Донецька область, Костянтинівський район, Білокузьминівка",
  "1422482001,  Донецька область, Костянтинівський район, Віролюбівка",
  "1422485703,  Донецька область, Костянтинівський район, Ступочки",
  "1422483707,  Донецька область, Костянтинівський район, Федорівка",
  "1422484113,  Донецька область, Костянтинівський район, Червоне",
  "1422484001,  Донецька область, Костянтинівський район, Миколаївка",
  "1422485701,  Донецька область, Костянтинівський район, Предтечине",
  "1422484003,  Донецька область, Костянтинівський район, Подільське",
  "1422484111,  Донецька область, Костянтинівський район, Стінки",
  "1422483703,  Донецька область, Костянтинівський район, Майське",
  "1422482502,  Донецька область, Костянтинівський район, Біла Гора",
  "1422482503,  Донецька область, Костянтинівський район, Диліївка",
  "1422482504,  Донецька область, Костянтинівський район, Неліпівка",
  "1422484101,  Донецька область, Костянтинівський район, Новодмитрівка",
  "1422482007,  Донецька область, Костянтинівський район, Попасне"
];
const grom52301 = [
  "1422485002,  Донецька область, Костянтинівський район, Попів Яр",
  "1422485806,  Донецька область, Костянтинівський район, Олександропіль",
  "1422481003,  Донецька область, Костянтинівський район, Степанівка",
  "1422485805,  Донецька область, Костянтинівський район, Новооленівка",
  "1422481001,  Донецька область, Костянтинівський район, Довга Балка",
  "1422485001,  Донецька область, Костянтинівський район, Полтавка",
  "1422485004,  Донецька область, Костянтинівський район, Русин Яр",
  "1422485802,  Донецька область, Костянтинівський район, Березівка",
  "1422483001,  Донецька область, Костянтинівський район, Катеринівка",
  "1422484201,  Донецька область, Костянтинівський район, Нова Полтавка",
  "1422485803,  Донецька область, Костянтинівський район, Водяне Друге",
  "1422480501,  Донецька область, Костянтинівський район, Олександро-Калинове",
  "1422481002,  Донецька область, Костянтинівський район, Розкішне",
  "1422482301,  Донецька область, Костянтинівський район, Зоря",
  "1422483002,  Донецька область, Костянтинівський район, Клебан-Бик",
  "1422485501,  Донецька область, Костянтинівський район, Стара Миколаївка",
  "1422485504,  Донецька область, Костянтинівський район, Калинове",
  "1422485801,  Донецька область, Костянтинівський район, Тарасівка",
  "1422482701,  Донецька область, Костянтинівський район, ІЛЛІНІВКА",
  "1422480503,  Донецька область, Костянтинівський район, Яблунівка"
];

class ChoiceSearchController extends GetxController {
  List vacancy0 = [];
  List<Vac> vacancy = <Vac>[].obs;
  List<Vac> filteredVac = <Vac>[].obs;
  List<Vac> filteredVac0 = <Vac>[].obs;
  RxBool isLoading = true.obs;
  RxBool isLoad = false.obs;
  late dynamic value;
  late List gromada = [].obs;

  @override
  void onInit() {
    value = Get.arguments;
    gromada = int.parse(value) == 55900
        ? grom55900
        : int.parse(value) == 55901
            ? grom55901
            : int.parse(value) == 55902
                ? grom55902
                : int.parse(value) == 55903
                    ? grom55903
                    : [];
    fetchVac();
    //print(gromada.length);
    //print(value);
    //print(gromada);
    super.onInit();
  }

  void fetchVac() async {
    try {
      vacancy0 = (await VacRepository.getAllVac());
      vacancy0.forEach((item) {
        for (int i = 0; i < gromada.length; i++)
          if (item.placevac == gromada[i]) {
            vacancy.add(item);
          }
      });
    } finally {
      isLoading.value = false;
    }
  }

  filteredVacancy(value) {
    filteredVac = vacancy
        .where((item) =>
            (item.posadavac.toLowerCase().contains(value.toLowerCase()) ||
                item.salaryvac.toLowerCase().contains(value.toLowerCase())))
        .toList();
    //  filteredVac.add( filteredVac0 );
    // filteredVac.sort;
    // filter();
    print(filteredVac);
    print(filteredVac.length);

    /*  for (int i = 0; i < filteredVac0.length; i++) {
        var item =filteredVac0[i];
      filteredVac.add(item);

  };*/
// print(filteredVac0);
    //print(filteredVac0.length);
  }
}
